RockstarPS/Einstein/programs/reference/einstein4.0/ti-am62x/ui-core/iceapple/ui.core.iceapple.test/iceapple.gdt.test.fw/openvg_monotype/common/dcu_win32/MPC560xS.h
/* Former declaration included to allow backwards compatibility
        union {
            vuint32_t R;
            struct {
                vuint32_t PERIPH:32;
            } B;
        } PS[4];            */         /* Peripheral Status 0->4 Register */

        union {
            vuint32_t R;
            struct {
                vuint32_t S_BAM:1;
                  vuint32_t:7;
                vuint32_t S_DMA_CH_MUX:1;
                  vuint32_t:5;
                vuint32_t S_FLEXCAN1:1;
                vuint32_t S_FLEXCAN0:1;
                  vuint32_t:5;
                vuint32_t S_QUADSPI:1;
                  vuint32_t:4;
                vuint32_t S_DSPI1:1;
                vuint32_t S_DSPI0:1;
                  vuint32_t:4;
            } B;
        } PS0;                         /* Peripheral Status 0 Register */

        union {
            vuint32_t R;
            struct {
                vuint32_t S_DCU:1;
                vuint32_t S_SGL:1;
                vuint32_t S_LCD:1;
                vuint32_t S_CANSAMPLER:1;
                  vuint32_t:3;
                vuint32_t S_GAUGEDRIVER:1;
                  vuint32_t:6;
                vuint32_t S_LINFLEX1:1;
                vuint32_t S_LINFLEX0:1;
                vuint32_t S_I2C_DMA3:1;
                vuint32_t S_I2C_DMA2:1;
                vuint32_t S_I2C_DMA1:1;
                vuint32_t S_I2C_DMA0:1;
                  vuint32_t:11;
                vuint32_t S_ADC0:1;
            } B;
        } PS1;                         /* Peripheral Status 1 Register */

        union {
            vuint32_t R;
            struct {
                  vuint32_t:3;
                vuint32_t S_PIT_RTI:1;
                vuint32_t S_RTC_API:1;
                vuint32_t S_MC_PCU:1;
                vuint32_t S_MC_RGM:1;
                vuint32_t S_MC_CGM:1;
                vuint32_t S_MC_ME:1;
                vuint32_t S_SSCM:1;
                  vuint32_t:9;
                vuint32_t S_CFLASH1:1;
                  vuint32_t:2;
                vuint32_t S_EMIOS1:1;
                vuint32_t S_EMIOS0:1;
                  vuint32_t:2;
                vuint32_t S_WKPU:1;
                vuint32_t S_SIUL:1;
                vuint32_t S_DFLASH0:1;
                vuint32_t S_CFLASH0:1;
                  vuint32_t:2;
            } B;
        } PS2;                         /* Peripheral Status 0 Register */

        union {
            vuint32_t R;
            struct {
                  vuint32_t:24;
                vuint32_t S_CMU0:1;
                  vuint32_t:7;
            } B;
        } PS3;                         /* Peripheral Status 0 Register */

        int32_t ME_reserved4[4];

        union {
            vuint32_t R;
            struct {
                  vuint32_t:24;
                vuint32_t RUN3:1;
                vuint32_t RUN2:1;
                vuint32_t RUN1:1;
                vuint32_t RUN0:1;
                vuint32_t DRUN:1;
                vuint32_t SAFE:1;
                vuint32_t TEST:1;
                vuint32_t RESET:1;
            } B;
        } RUNPC[8];                    /* RUN Peripheral Configuration 0->7 Register */

        union {
            vuint32_t R;
            struct {
                  vuint32_t:18;
                vuint32_t STANDBY:1;
                  vuint32_t:2;
                vuint32_t STOP:1;
                  vuint32_t:1;
                vuint32_t HALT:1;
                  vuint32_t:8;
            } B;
        } LPPC[8];                     /* Low Power Peripheral Configuration 0->7 Register */

        union {
            vuint8_t R;
            struct {
                  vuint8_t:1;
                vuint8_t DBG_F:1;
                vuint8_t LP_CFG:3;
                vuint8_t RUN_CFG:3;
            } B;
        } PCTL[144];                   /* Peripheral Control 0->143 Register */

    };                                 /* end of ME_tag */
/****************************************************************************/
/*                             MODULE : CGM                                 */
/****************************************************************************/
    struct CGM_tag {

    /* The CGM provides a unified register interface, enabling access to
       all clock sources:

     Base Address |  Clock Sources
    -------------------------------
     C3FE0000      | FXOSC_CTL
     -              | Reserved
     C3FE0040      | SXOSC_CTL
     C3FE0060      | FIRC_CTL
     C3FE0080      | SIRC_CTL
     C3FE00A0      | FMPLL_0
     C3FE00C0      | FMPLL_1
     -              | Reserved
     C3FE0100      | CMU_0 & CMU_1
    */

    /***************************************/
    /* OSC_CTL @ CGM base address + 0x0000 */
    /***************************************/
        union {
            vuint32_t R;
            struct {
                vuint32_t OSCBYP:1;
                  vuint32_t:7;
                vuint32_t EOCV:8;
                vuint32_t M_OSC:1;
                  vuint32_t:2;
                vuint32_t OSCDIV:5;
                vuint32_t I_OSC:1;
                  vuint32_t:7;
            } B;
        } FXOSC_CTL;                   /* Main OSC Control Register */

    /*****************************************/
    /* LPOSC_CTL @ CGM base address + 0x0040 */
    /*****************************************/
        int32_t CGM_reserved0[15];     /* (0x040 - 0x004)/4 = 0x0F */

        union {
            vuint32_t R;
            struct {
                vuint32_t OSCBYP:1;
                  vuint32_t:7;
                vuint32_t EOCV:8;
                vuint32_t M_OSC:1;
                  vuint32_t:2;
                vuint32_t OSCDIV:5;
                vuint32_t I_OSC:1;
                  vuint32_t:5;
                vuint32_t S_OSC:1;
                vuint32_t OSCON:1;
            } B;
        } SXOSC_CTL;                   /* Low Power OSC Control Register */

    /**************************************/
    /* RC_CTL @ CGM base address + 0x0060 */
    /**************************************/
        int32_t CGM_reserved1[7];      /* (0x060 - 0x044)/4 = 0x07 */

        union {
            vuint32_t R;
            struct {
                  vuint32_t:10;
                vuint32_t RCTRIM:6;
                  vuint32_t:3;
                vuint32_t RCDIV:5;
                  vuint32_t:2;
                vuint32_t S_RC_STDBY:1;
                  vuint32_t:5;
            } B;
        } FIRC_CTL;                    /* RC OSC Control Register */

    /****************************************/
    /* LPRC_CTL @ CGM base address + 0x0080 */
    /****************************************/
        int32_t CGM_reserved2[7];      /* (0x080 - 0x064)/4 = 0x07 */

        union {
            vuint32_t R;
            struct {
                  vuint32_t:11;
                vuint32_t LRCTRIM:5;
                  vuint32_t:3;
                vuint32_t LPRCDIV:5;
                  vuint32_t:3;
                vuint32_t S_LPRC:1;
                  vuint32_t:3;
                vuint32_t LPRCON_STDBY:1;
            } B;
        } SIRC_CTL;                    /* Low Power RC OSC Control Register */

