RockstarPS/Einstein/programs/reference/einstein4.0/ti-am62x/ui-core/iceapple/ui.core.iceapple.test/iceapple.gdt.test.fw/openvg_monotype/common/dcu_win32/MPC560xS.h
        union {                        /* User Test Register 1 */
            vuint32_t R;
            struct {
                vuint32_t DAI:32;
            } B;
        } UT1;

        union {                        /* User Test Register 2 */
            vuint32_t R;
            struct {
                vuint32_t DAI:32;
            } B;
        } UT2;

        union {                        /* User Multiple Input Signature Register 0-4 */
            vuint32_t R;
            struct {
                vuint32_t MS:32;
            } B;
        } UMISR[5];

    };                                 /* end of CFLASH_tag */
/******************************************************************
| defines and macros (scope: module-local)
|-----------------------------------------------------------------*/
/* Define instances of modules */
/*#define CFLASH0         (*(volatile struct CFLASH_tag *)    0xC3F88000UL)
#define DFLASH          (*(volatile struct DFLASH_tag *)    0xC3F8C000UL)
#define SIU             (*(volatile struct SIU_tag *)       0xC3F90000UL)
#define WKUP            (*(volatile struct WKUP_tag *)      0xC3F94000UL)
#define EMIOS_0         (*(volatile struct EMIOS_tag *)     0xC3FA0000UL)
#define EMIOS_1         (*(volatile struct EMIOS_tag *)     0xC3FA4000UL)
#define CFLASH1         (*(volatile struct CFLASH_tag *)    0xC3FB0000UL)
#define SSCM            (*(volatile struct SSCM_tag *)      0xC3FD8000UL)
#define ME              (*(volatile struct ME_tag *)        0xC3FDC000UL)
#define CGM             (*(volatile struct CGM_tag *)       0xC3FE0000UL)
#define RGM             (*(volatile struct RGM_tag *)       0xC3FE4000UL)
#define PCU             (*(volatile struct PCU_tag *)       0xC3FE8000UL)
#define RTC             (*(volatile struct RTC_tag *)       0xC3FEC000UL)
#define PIT             (*(volatile struct PIT_tag *)       0xC3FF0000UL)
#define ADC_0           (*(volatile struct ADC_tag *)       0xFFE00000UL)
#define I2C_0           (*(volatile struct I2C_tag *)       0xFFE30000UL)
#define I2C_1           (*(volatile struct I2C_tag *)       0xFFE34000UL)
#define I2C_2           (*(volatile struct I2C_tag *)       0xFFE38000UL)
#define I2C_3           (*(volatile struct I2C_tag *)       0xFFE3C000UL)
#define LINFLEX_0       (*(volatile struct LINFLEX_tag *)   0xFFE40000UL)
#define LINFLEX_1       (*(volatile struct LINFLEX_tag *)   0xFFE44000UL)
#define SMC             (*(volatile struct SMC_tag *)       0xFFE60000UL)
#define SSD_0           (*(volatile struct SSD_tag *)       0xFFE61000UL)
#define SSD_1           (*(volatile struct SSD_tag *)       0xFFE61800UL)
#define SSD_2           (*(volatile struct SSD_tag *)       0xFFE62000UL)
#define SSD_3           (*(volatile struct SSD_tag *)       0xFFE62800UL)
#define SSD_4           (*(volatile struct SSD_tag *)       0xFFE63000UL)
#define SSD_5           (*(volatile struct SSD_tag *)       0xFFE63800UL)
#define CANSP           (*(volatile struct CANSP_tag *)     0xFFE70000UL)
#define LCD             (*(volatile struct LCD_tag *)       0xFFE74000UL)
#define SGL             (*(volatile struct SGL_tag *)       0xFFE78000UL)
#define DCU             (*(volatile struct DCU_tag *)       0xFFE7C000UL)
#define MPU             (*(volatile struct MPU_tag *)       0xFFF10000UL)
#define SWT             (*(volatile struct SWT_tag *)       0xFFF38000UL)
#define STM             (*(volatile struct STM_tag *)       0xFFF3C000UL)
#define ECSM            (*(volatile struct ECSM_tag *)      0xFFF40000UL)
#define EDMA            (*(volatile struct EDMA_tag *)      0xFFF44000UL)
#define INTC            (*(volatile struct INTC_tag *)      0xFFF48000UL)
#define DSPI_0          (*(volatile struct DSPI_tag *)      0xFFF90000UL)
#define DSPI_1          (*(volatile struct DSPI_tag *)      0xFFF94000UL)
#define QUADSPI_0       (*(volatile struct QUADSPI_tag *)   0xFFFA8000UL)
#define CAN_0           (*(volatile struct FLEXCAN_tag *)   0xFFFC0000UL)
#define CAN_1           (*(volatile struct FLEXCAN_tag *)   0xFFFC4000UL)
#define DMAMUX          (*(volatile struct DMAMUX_tag *)    0xFFFDC000UL)
*/
#ifdef __MWERKS__
#pragma pop
#endif

#ifdef  __cplusplus
}
#endif
#endif                            /* ifdef _JDP_H */
/* End of file */

#endif